In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import datetime

* Loading the processed Data

In [32]:
prices=pd.read_csv("proc_prices_table_2018.csv",usecols=["Name","Avg Unit Price"])
count=pd.read_csv("proc_inventory_count_table.csv",usecols=["EntryDate","Class","Type","Count"])
rates=pd.read_csv("proc_consumption_rates_table.csv",usecols=["Name","Name_AR","Average"])

* A look on the prices data

In [15]:
prices.head()

                       Name  Avg Unit Price
0  حقنة أيليا (1/3 أمبول )      1301.666667
1           زجاجة Revonto\t     1164.000000
2          صوديوم بيكربونات       28.333333
3             كانيولا لليزك       46.666667
4                ميكروباك\t        8.486667

* A look on the inventory count data

In [4]:
count.head()

    EntryDate                      Class            Type  Count
0  2018-01-06               مشارط جراحية     كيراتوم 1.2   4956
1  2018-01-06               مشارط جراحية      كيراتوم2.2   5976
2  2018-01-06               مشارط جراحية      كيراتوم2.4    510
3  2018-01-06                     سرنجات       سرنجة 5سم   7800
4  2018-01-06  جوانتيات معقمه وغير معقمه  جوانتى أنسيل 7   5780

* A look on the consumption rates data

In [5]:
rates.head()

                               Name             Name_AR  Average
0  أمبولات ببترليف (بديل الزانتاك )    D.C.R. - العينين        1
1                  أمبولات فولتارين    D.C.R. - العينين        1
2                     بخاخة أوترفين    D.C.R. - العينين        1
3                         جلوكوز 5%  D.C.R. - عين واحدة        1
4  أمبولات ببترليف (بديل الزانتاك )  D.C.R. - عين واحدة        1

* Merging the Consumption Rates & the Prices data

In [29]:
merged_data=rates[:]
merged_data=merged_data.merge(prices,on="Name")
merged_data.head()

,Name,Name_AR,Average,Avg Unit Price
0,أمبولات ببترليف (بديل الزانتاك ),D.C.R. - العينين,1,1.386667
1,أمبولات ببترليف (بديل الزانتاك ),D.C.R. - عين واحدة,1,1.386667
2,أمبولات ببترليف (بديل الزانتاك ),إاستئصال ورم من الحجاج,1,1.386667
3,أمبولات ببترليف (بديل الزانتاك ),ازالة جسم زجاجي,1,1.386667
4,أمبولات ببترليف (بديل الزانتاك ),أزالة عدسة + زرع عدسة,1,1.386667

* Grouping the dat by each operation

In [30]:
gr_merged_data=merged_data.groupby(merged_data.Name_AR)

* Calculating the number of SKUs and their values for each operation

In [31]:
x=gr_merged_data.sum()
x.rename(columns={"Average":"num_SKU","Avg Unit Price":"SKU_total_cost"})

                                                   num_SKU  SKU_total_cost
Name_AR
 ترقيع للملتحمه                                          8      382.701795
D.C.R. - العينين                                        25      544.536480
D.C.R. - عين واحدة                                      31      737.147449
LASIK                                                   64     1672.320222
LASIK*                                                   9      280.886588
...                                                    ...             ...
ليزك + تثبيت                                            24     2364.799605
مياة بيضاء + قناة دمعية                                  7     1790.390643
مياة بيضاء و زرع عدسة + جسم زجاجي + حقن السيليكون       13     2023.898382
نركيب ثقل ذهبى                                           6       46.268000
وشم / صبغة قرنيه                                        32     2055.664522

[258 rows x 2 columns]